Autodesk.Revit.DB.Analysis.SizingOptions.GetPipeSizes(Autodesk.Revit.DB.Plumbing.PipeType)
Returns the available pipe sizes from the associated PipeSegments.
pipeType:
The pipe element type where the pipe segments are defined.
Returns:
The list of available pipe sizes.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.Analysis.SizingOptions.GetDuctSizes(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ConnectorProfileType)
Returns the available duct sizes for the specified profile.
doc:
The document where the duct sizes are defined.
profileType:
The profile type of the duct sizes to return, such as round, rectangular or oval.
Returns:
The list of available duct sizes, used for both width and height.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2027

Autodesk.Revit.DB.Analysis.SizingOptions.SetEquivalentHeight(System.Double,System.Collections.Generic.ISet{Autodesk.Revit.DB.MEPSize})
Sets the equivalent height based on the specified width.
Remarks:
The equivalent height is calculated based on the specified width and the available sizes. If successful, the new width and height in the options
provide the same or similar friction loss as the previous width and height.
fixedWidth:
The new width.
availableSizes:
The sorted list of available sizes, where the equivalent height will be selected.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for fixedWidth must be positive.
-or-
The fixedWidth must be within the range of availableSizes.
-or-
The new size must be within the range of available sizes.
Since:
2027

Autodesk.Revit.DB.Analysis.SizingOptions.SetEquivalentWidth(System.Double,System.Collections.Generic.ISet{Autodesk.Revit.DB.MEPSize})
Sets the equivalent width based on the specified height.
Remarks:
The equivalent width is calculated based on the specified height and the available sizes. If successful, the new width and height in the options
provide the same or similar friction loss as the previous width and height.
fixedHeight:
The new height.
availableSizes:
The sorted list of available sizes, where the equivalent width will be selected.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for fixedHeight must be positive.
-or-
The fixedHeight must be within the range of availableSizes.
-or-
The new size must be within the range of available sizes.
Since:
2027

Autodesk.Revit.DB.Analysis.SizingOptions.SetNextAvailableSize(Autodesk.Revit.DB.ConnectorProfileType,System.Double,System.Double,System.Collections.Generic.ISet{Autodesk.Revit.DB.MEPSize})
Sets the next available size based on the specified inner diameter.
profileType:
The profile type of the duct or pipe, such as round, rectangular or oval.
width:
The width value that the next available size must exceed.
height:
The height value that the next available size must exceed.
availableSizes:
The sorted list of available sizes for both width and height, where the smallest possible size yet larger than the specified value will be selected.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for width must be positive.
-or-
The given value for height must be positive.
-or-
The width must be within the range of availableSizes.
-or-
The height must be within the range of availableSizes.
-or-
A value passed for an enumeration argument is not a member of that enumeration
Since:
2027

Autodesk.Revit.DB.Analysis.SizingOptions.SetNextAvailableSize(System.Double,System.Collections.Generic.ISet{Autodesk.Revit.DB.MEPSize})
Sets the next available size based on the specified inner diameter.
innerDiameter:
The inner diameter threshold that the next available size must exceed.
availableSizes:
The sorted list of available sizes, where the smallest possible size yet larger than the specified inner diameter will be selected.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for innerDiameter must be positive.
-or-
The innerDiameter must be within the range of availableSizes.
Since:
2027

Autodesk.Revit.DB.Analysis.SizingOptions.IsValid
Checks if the options are valid and ready for sizing operation.
Remarks:
The options are valid if the parameters including density and viscosity are correctly initialized to be non-zero values,
Returns:
Returns true if the options are valid, false otherwise.
Since:
2027

Autodesk.Revit.DB.Analysis.SizingOptions.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Analysis.SizingOptions.Diameter
The diameter of round duct or pipe in feet.
Since:
2027

Autodesk.Revit.DB.Analysis.SizingOptions.Width
The width of the duct or pipe in feet.
Since:
2027

Autodesk.Revit.DB.Analysis.SizingOptions.Area
The area of the specified sizing profile and dimension.
Since:
2027

Autodesk.Revit.DB.Analysis.SizingOptions.Height
The height of the duct or pipe in feet.
Since:
2027

Autodesk.Revit.DB.Analysis.SizingOptions.WidthOrDiameter
The width or diameter of the duct or pipe in feet.
Since:
2027

Autodesk.Revit.DB.Analysis.SizingOptions.MaxSize
The maximal size in feet, defaults to 2 feet.
Since:
2027

Autodesk.Revit.DB.Analysis.SizingOptions.MinSize
The minimal size in feet, defaults to 0.041666 ft (0.5 inch).
Since:
2027

Autodesk.Revit.DB.Analysis.SizingOptions.Viscosity
The air or fluid viscosity in kg/(ft*s), defaults to the air dynamic viscosity at 20ºC.
Since:
2027

Autodesk.Revit.DB.Analysis.SizingOptions.Density
The air or fluid density in kg/ft^3, defaults to the dry air density at 20ºC.
Since:
2027

Autodesk.Revit.DB.Analysis.SizingOptions.Roughness
The material roughness in ft, defaults to 0.0003 ft.
Since:
2027

Autodesk.Revit.DB.Analysis.SizingOptions.ProfileType
The profile type of the options, such as round, rectangular or oval.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2027

Autodesk.Revit.DB.Analysis.SizingOptions.DomainType
The domain type of the options, such as HVAC or Plumbing.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2027

Autodesk.Revit.DB.Analysis.SizingOptions.#ctor(Autodesk.Revit.DB.Element)
Constructs a new instance of the SizingOptions with specified parameters.
Remarks:
The sizing parameters are extracted from the specified curve element, including the curve domain and
profile, roughness, fluid density and viscosity, the available size range, and etc.
ductOrPipeCurve:
The element of a duct or pipe curve where the sizing parameters are extracted.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element must be a valid duct or pipe curve object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.Analysis.SizingOptions.#ctor
Constructs a new instance of the SizingOptions with default parameters.
Remarks:
The default SizingOptions represents a round duct profile with the air density and viscosity values.
Since:
2027

Autodesk.Revit.DB.Analysis.SizingOptions.#ctor(Autodesk.Revit.DB.Analysis.SizingOptions)
Constructs a new copy of the SizingOptions object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.Analysis.SizingOptions
Contains the options for MEP sizing parameters, such as profile type, material roughness,
fluid density and viscosity, minimal and maximal sizes, and etc.
Since:
2027